import React from "react"; 

const PrivacyPolicyContent = () => {
  return (
    <>
      <div className="text-container ptb-100">
        <div className="container">
          <h6> الاستخدام الغير مشروع</h6>

          <p>
          لا يجب استخدام خدمات شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة 
          (KATECHS) لأغراض غير مشروعة أو لمساندة 
          أنشطة غير مشروعة. و شركة كاتكس كنوز الجيل للتكنولوجيا
           المتطورة (KATECHS) بحقها في التعاون مع السلطات القانونية والرسمية
            أو الأطراف الثالثة المتضررة للتحقيق لدى 
           الاشتباه بوجود جريمة أو ارتكاب أخطاء مدنية          </p>

          <h6>إلحاق الأذى بالقصر</h6>
          <p>
          يحظر تمامًا استخدام خدمات أو منصات شركة كاتكس كنوز
           الجيل للتكنولوجيا المتطورة 
           (KATECHS) في أي نشاط من شأنه إلحاق الأذى بالقُصَّر أو محاولة إيذائهم، بأي وسيلة كانت، بما
            في ذلك – على سبيل المثال لا الحصر – استغلالهم في المواد الإباحية أو الترويج لها 
           أو تداولها. وتحتفظ 
          الشركة بكامل الحق في اتخاذ كافة الإجراءات القانونية اللازمة ضد أي فرد 
          أو جهة يثبت تورطهم في مثل هذه الأنشطة المحظورة
          </p>

{/* FREE PALSTINE   */} 

          <h6>التهديد</h6>
          <p>
          يُحظر استخدام شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) 
          في نقل أي محتوى، سواء عبر البريد
           الإلكتروني أو التحميل أو النقل أو غير ذلك من الوسائل، إذا 
          كان من شأن هذا 
          المحتوى 
          أن يتضمن تهديدًا بإلحاق ضرر جسدي أو إتلاف للممتلكات أو التحريض على ذلك بأي شكل من الأشكال          </p>

          


          <h6>	الإزعاج</h6>

          <p>
          يُحظر استخدام شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) 
          في نقل أي مادة، سواء عبر البريد الإلكتروني أو التحميل أو 
          النقل أو أي وسيلة أخرى، بهدف إزعاج الآخرين أو التسبب في أي إزعاج لهم          </p>



          <h6>	أعمال الغش</h6>

          <p>
          يُحظر استخدام شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) في تقديم عروض مُضلِّلة 
          بغرض بيع 
          أو شراء
           منتجات
           أو سلع 
          أو خدمات، 
          أو لدعم أي 
          نوع من أنواع
           الاحتيال المالي، بما في
           ذلك ما يُعرف بـ 'مشاريع
           المضاربات الهرمية
          ' أو 'الرسائل المتسلسلة          </p>

          <h6>استخدامات البريد الالكتروني التجاري و العام الغير مسموح بها</h6>

          <p>
          يُمنع منعًا باتًا استخدام شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) في إرسال الرسائل الإلكترونية التجارية
           أو العامة دون طلبٍ مسبق من 
          المستلم أو الحصول على موافقته
           الصريحة. ويؤدي أي خرق لهذا الشرط إلى الإلغاء
           الفوري لحساب الجهة 
          المخالفة لدى شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS)          </p>

          <h6>خدمات البريد الإلكتروني/الإخبارية</h6>

          <p>
          تؤدي أي نية خبيثة لتعطيل استخدام خدمات البريد الإلكتروني 
          أو الخدمات الإخبارية من قبل أي طرف 
          آخر إلى الإلغاء الفوري لحساب الجهة المخالفة لدى شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS)</p>

          <h6>	عدم استخدام شبكة مؤسسة كنوز الجيل لتقنية المعلومات (KATECHX)</h6>

          <p>
          لا تسمح سياسة شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) مطلقًا بنقل الرسائل أو الإعلانات التجارية 
          عبر شبكتها إذا كانت مخالفة للوائح 
          أو القوانين 
          المنظمة للمجموعات الإخبارية أو القوائم البريدية، بما في ذلك إرشادات الأسئلة الشائعة (FAQ). 
          ومع ذلك، يُسمح بنقل الرسائل التجارية المتوافقة
           مع تلك اللوائح، أو تلك التي تم طلبها صراحة من قِبل المستلم، وذلك ضمن الحدود المسموح بها          </p>


          <h6>	مخالفة حقوق الطبع أو العلامات التجارية</h6>

          <p>
          يُحظر استخدام شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) في نقل أي مادة – سواء عبر 
          البريد الإلكتروني أو التحميل 
          أو التحويل أو غير ذلك – من شأنها 
          الإخلال بحقوق الطبع والنشر أو 
          العلامات التجارية أو براءات الاختراع
           أو الأسرار التجارية أو أي من حقوق 
          الملكية الفكرية العائدة لأي طرف 
          آخر. ويشمل ذلك – دون حصر – 
          التصوير غير المصرح
           به لمواد محمية بحقوق النشر
          ، والتصوير الرقمي وتوزيع
           الصور المأخوذة من المجلات أ
          و الكتب أو غيرها من المصادر
           الخاضعة لتلك الحقوق، بالإضافة 
          إلى نقل البرامج المحمية
           بحقوق الطبع والنشر
           دون إذن مسبق          </p>

          <h6>	جمع بيانات شخصية</h6>

          <p>
          يُحظر استخدام شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) في جمع أو محاولة جمع معلومات شخصية عن أي طرف ثالث دون علمه أو دون الحصول على موافقته الصريحة          
          </p>

          <h6>	تعطيل الشبكة و الأنشطة المعادية</h6>

          <p>
          يُحظر استخدام شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة  (KATECHS) في أي أنشطة من شأنها التأثير على قدرة أطراف أو أنظمة أخرى على استخدام خدمات المؤسسة أو الإنترنت، بما في ذلك تنفيذ هجمات حجب الخدمة (DoS) أو الهجمات الموجهة ضد مزودي خدمات الشبكة أو المستخدمين الأفراد. كما يُمنع التداخل مع مستخدمي الشبكة الآخرين أو تعطيل خدماتهم أو معداتهم.

ويقع على عاتق المشترك مسؤولية تأمين إعدادات شبكته الخاصة، ولا يجوز له، سواء بشكل مباشر أو غير مباشر، السماح باستخدام شبكته في أنشطة غير قانونية أو غير لائقة. ويُمنع تنظيم الشبكة بطريقة تتيح لطرف ثالث استخدامها في أنشطة تنتهك القوانين أو الأعراف السليمة.

ويُعدّ الدخول غير المشروع إلى أنظمة الحاسوب العائدة لشركات أو أفراد آخرين، أو استخدامها دون إذن، مخالفةً جسيمة تؤدي إلى الإلغاء الفوري للحساب. كما تُحظر أي محاولات للوصول غير المصرح به إلى حسابات الغير أو لاختراق النظم الأمنية، سواء ترتب على ذلك تلف أو فقدان للبيانات أم لا
     </p>

          <h6>	الغش</h6>

          <p>
          يُحظر كذلك تضمين أي بيانات أو كتابات مضللة أو عرضها بشكل مغلوط عن علم، أو القيام بأنشطة تهدف إلى التضليل المتعمد، مما قد يدفع من يطلع عليها إلى اتخاذ قرارات أو إجراءات استنادًا إلى تلك المعلومات غير الدقيقة.

كما يُحظر الإخلال بحقوق الطبع والنشر، أو البراءات، أو العلامات التجارية، أو الأسرار التجارية أو أي من حقوق الملكية الفكرية الأخرى. ولا يُسمح بتوزيع أو تحويل المواد الخاضعة لحقوق الطبع والنشر، كما يُحظر القيام بأي تجاوزات في هذا المجال
          </p>




          <h6>	الاستخدام غير السليم للبرامج </h6>

          <p>
          قد يترتب على استخدام البرامج أو الأدوات التي تساهم في استمرارية الاتصال أثناء استخدام خدمات شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) تعليق الخدمات          </p>

          <h6>	المحاسبة بسبب طرف ثالث</h6>

          <p>
          تُعتبر مسؤولية مشتركي شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) محاسبية عن أي نشاط تقوم به أطراف ثالثة باستخدام حساباتهم، وذلك في حال كان هذا النشاط مخالفًا للموجهات المحددة في إطار سياسة الاستخدام المقبول          </p>

          <h6>	 الأعطال و الدعم الفني   </h6>

          <p>
          في حال توقف استضافة العميل عن العمل، ستقوم شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) بالعمل على إعادة تشغيل الاستضافة في مدة أقصاها 48 ساعة من تاريخ ووقت علم المؤسسة بحدوث العطل، وذلك من خلال استقبال بريد إلكتروني على العنوان وقد يتطلب الأمر وقت أكثر لتصليح العطل حسب نوع العطل support@katechs.com.
إذا توقفت استضافة العميل بسبب سوء استخدام العميل أو تركيبه لبرامج نصية غير مرخصة أو لم يتم تحديثها بشكل دوري يتحمل العميل مسؤولية ذلك ويتحمل تكلفة إعادة الخدمة
    </p>
          

    <h6>	 ضمان عمل الخدمة 99.9 %   </h6>

<p>
قد نقوم بتعديل هذا الإشعار وننشر النسخة المحدثة على نفس الصفحة أو من خلال وسائل تواصل أخرى. ولن يتم تقليل الحقوق المكتسبة للأفراد بأثر رجعي</p>




        </div>
      </div>
    </>
  );
};

export default PrivacyPolicyContent;
