import React from "react";
import NewsSidebar from "./NewsSidebar";
import Link from "next/link";
import Image from "next/image";

import blogDetailImg1 from "../../public/images/blog-details/security-blog.png";

const NewsDetailsContent = () => {
  return (
    <>
      <section className="news-details-area ptb-100">
        <div className="container">
          <div className="row">
            <div className="col-lg-12 col-md-12">
              <div className="blog-details-desc">
                

                <div className="article-content">
                 

                  <h3>
                  الاستخدام الغير مشروع
                  </h3>

                  <p>
                  لا يجب استخدام خدمات كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) 
                  لأغراض غير مشروعة أو لمساندة أنشطة غير مشروعة. و تحتفظ كاتكس كنوز الجيل للتكنولوجيا 
                  المتطورة (KATECHS) بحقها في التعاون مع السلطات القانونية والرسمية أو
                   الأطراف الثالثة المتضررة للتحقيق لدى الاشتباه بوجود جريمة أو ارتكاب أخطاء مدنية.
                  </p>
    
                  


                  <h3>
                  إلحاق الأذى بالقصر
                  </h3>
                  <p>
                  استخدام كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) 
                  لإلحاق الأذى أو محاولة إلحاق الأذى بالقصر بأي من الأساليب التي تشتمل 
                  و لكن لا تقتصر على الإباحية فيما يتعلق بالأطفال.
                  </p>
                  


                  <h3>
                  التهديد
                  </h3>
                  <p>
                  لا يجب استخدام كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) لنقل
                   أي مادة (عن طريق البريد الالكتروني، و التحميل، و التحويل و غيرها)
                   من شأنها التهديد بإحداث ضرر جسماني أو إتلاف للممتلكات أو تشجيع ذلك.
                  </p>
                  
                 

                  <h3>
                  الإزعاج
                  </h3>
                  <p>
                  لا يجب استخدام كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) لنقل أي مادة 
                  (عن طريق البريد الالكتروني، و التحميل، و التحويل و غيرها) لإزعاج الآخرين.
                  </p>
                  
          

                  <h3>
                  أعمال الغش
                  </h3>
                  <p>
                  لا يجب استخدام كاتكس كنوز الجيل للتكنولوجيا المتطورة 
                  (KATECHS) لتقديم عروض من باب الخداع لبيع أو شراء منتجات أو بنود أو خدمات أو لدعم 
                  أي من أنواع الغش المالية بما في ذلك “مشاريع المضاربات الهرمية” و “الرسائل المسلسلة”.
                  </p>
                  


                  <h3>
                  استخدامات البريد الالكتروني التجاري و العام الغير مسموح بها
                  </h3>
                  <p>
                  يمنع منعا باتا استخدام شركة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) في نقل البريد الالكتروني التجاري و العام إلا بعد طلبها و 
                  الموافقة عليها. أي إخلال من هذا النوع سيؤدي إلى إلغاء حساب كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) المخالف فورا.
                  </p>
                  
          
                  <h3>
                  خدمات البريد الإلكتروني/الإخبارية
                  </h3>
                  <p>
                  النوايا الخبيثة لتعويق استخدام خدمات البريد
                   الإلكتروني و الخدمات الإخبارية من قبل شخص آخر يترتب 
                   عليها إلغاء حساب كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) المخالف على الفور.
                  </p>
                  
          
          
                  <h3>
                  عدم استخدام شبكة كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS)
                  </h3>
                  <p>
                  سياسة كاتكس كنوز الجيل للتكنولوجيا المتطورة 
                  (KATECHS) لا تسمح على الإطلاق بتحويل الرسائل أو الإعلانات التجارية عن طريق شبكتها بما يخالف نظم
                   و قوانين FAQ أو لوائح أي من المجموعات الإخبارية أو القوائم البريدية. و لكن يسمح بنقل 
                  الرسائل التجارية المتمشية مع قوانين المجموعات الإخبارية أو 
                  القوائم البريدية أو تلك التي طلبها المستقبل في حدود المسموح به.
                  </p>
                  
          
                  <h3>                
                مخالفة حقوق الطبع أو العلامات التجارية
                  </h3>
                  <p>
                  استخدام كاتكس كنوز الجيل للتكنولوجيا المتطورة 
                  (KATECHS) في نقل أي مادة (عن طريق البريد الإلكتروني أو
                   التحميل أو التحويل أو غير ذلك) بما من شأنه الإخلال بأي حقوق للطبع أو
                    بالعلامات التجارية أو براءات الاختراع، أو 
                  الأسرار التجارية أو غيرها من حقوق الملكية العائدة 
                  لأي طرف آخر و التي تشتمل و لكن لا تقتصر على التصوير الغير مسموح به لمادة 
                  خاضعة لحقوق الطبع و التصوير الرقمي و توزيع الصور المأخوذة من المجلات، 
                  و الكتب أو غيرها من المصادر الخاضعة لحقوق الطبع إضافة إلى
                   النقل الغير مسموح به لبرامج خاضعة لحقوق الطبع.
                  </p>
                  
          
          
                  <h3>
                  جمع بيانات شخصية
                  </h3>
                  <p>
                  استخدام كاتكس كنوز الجيل للتكنولوجيا المتطورة 
                  (KATECHS) في جمع أو في محاولة جمع معلومات
                   شخصية عن أطراف أخرى بدون علمهم أو موافقتهم
                  </p>
                  
          
          
                  <h3>
                  
                تعطيل الشبكة و الأنشطة المعادية     
                  </h3>
                  <p>
                  استخدام كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) في أي من الأنشطة التي تؤثر على 
                  مقدرة أشخاص آخرين أو أنظمة
                   أخرى في استخدام كاتكس كنوز
                   الجيل للتكنولوجيا المتطورة (KATECHS) أو الانترنت، بما في ذلك رفض الخدمات و الهجوم ضد مقدم خدمات آخر في الشبكة أو مستخدم فردي لها. و يمنع التداخل مع مستخدمي الشبكة الآخرين أو تعطيلهم أو التداخل مع أو تعطيل خدماتهم و معداتهم. و من مسئولية العضو المشترك التأكد من تأمين تنظيم شبكته. و لا يسمح للمشترك بفعله أو بغير فعله السماح للآخرين باستخدام شبكته لأعمال غير قانونية أو غير لائقة. و لا يسمح للمشترك بفعله أو بغير فعله بتنظيم شبكته بشكل يتيح لطرف ثالث إمكانية استخدام الشبكة بطريقة غير قانونية أو غير لائقة. كما أن الدخول في أنظمة كمبيوتر تابعة لشركات و/أو لأفراد آخرين و/أو استخدامها بطريقة غير مشروعة تؤدي و على الفور إلى إلغاء الحساب. و
                    لا تسمح كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) لأي مشترك يحاول الدخول إلى حسابات الآخرين أو يحاول اختراق الإجراءات الأمنية للأنظمة 
                  الأخرى سواء نتج أم لم ينتج عن الاختراق إفساد أو ضياع للبيانات.
                  </p>
                  
          
          
                  <h3>
                  الغش
                  </h3>
                  <p>
                  و يتضمن بيانات أو كتابات مضللة أو أسيء عرضها عن علم أو أنشطة جرى
                   القيام بها عن قصد بحيث أن من يطلع عليها سيعمل بموجبها.
                  </p>
                  
          
          
                  <h3>
                  الإخلال بحقوق الطبع، أو البراءات، أو العلامات التجارية، أو الأسرار التجارية أو حقوق الملكية الفكرية:
                  </h3>
                  <p>
                  ولا يسمح بتوزيع و/أو تحويل المواد الخاضعة لحقوق الطبع كما لا يسمح بالتجاوزات المتقدمة.
                  </p>
                  
          
          
                  <h3>
                  الاستخدام غير السليم للبرامج
                  </h3>
                  <p>
                  قد يترتب على استخدام البرامج أو استخدام أي أداة تساعد على استمرارية التوصيل connection
                   أثناء استخدام كاتكس كنوز الجيل للتكنولوجيا 
                  المتطورة (KATECHS) تعليق الخدمات.
                  </p>
                  
          
          
                  <h3>
                  المحاسبة بسبب طرف ثالث
                  </h3>
                  <p>
                  تقع على مشتركي كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) المسئولية مع المحاسبة مقابل أي نشاط تقوم به 
                  أطراف ثالثة مستخدمة حساباتهم بما يخالف الموجهات المحددة في إطار سياسة الاستخدام المقبول.
                  </p>
                  
          
          
                  <h3>
                  الدعم الفني
                  </h3>
                  <p>
                  إذا توقفت استضافة العميل عن العمل سوف يتم العمل على إعادة عمل الاستضافة في مدة أقصاها 48 ساعة من تاريخ وساعة علم كاتكس كنوز الجيل للتكنولوجيا المتطورة (KATECHS) بهذا العطل عن طريق استقبال بريد إلكتروني على katechs@katechs.com
إذا توقفت استضافة العميل بسبب سوء استخدام العميل أو تركيبه لبرامج نصية غير مرخصة أو لم يتم تحديثها بشكل دوري يتحمل العميل مسؤولية ذلك ويتحمل تكلفة إعادة الخدمة .

                  </p>
                  
          
          
                  <h3>
                  ضمان الخدمة
                  </h3>
                  <p>
                  ضمان عمل الخدمة 99.9 %
                  </p>
                  

                </div>



                {/* 

                <div className="post-navigation">
                  <div className="navigation-links">
                    <div className="nav-previous">
                      <Link href="#">
                        <i className="bx bx-left-arrow-alt"></i> Prev Post
                      </Link>
                    </div>

                    <div className="nav-next">
                      <Link href="#">
                        Next Post <i className="bx bx-right-arrow-alt"></i>
                      </Link>
                    </div>
                  </div>
                </div>

                
                <CommentsArea /> 
                
                */}
              </div> 
              </div>
              
            

{/* 
            <div className="col-lg-4 col-md-12">
              <NewsSidebar />
            </div> */}
          </div>
        </div>
      </section>
    </>
  );
};

export default NewsDetailsContent;
